olliw42/stm32ll-lib/src/stdstm32-uartf.h
#elif defined UARTF_USE_UART3 || defined UARTF_USE_UART3_REMAPPED
  #define UARTF_UARTx             USART3
  #if defined UARTF_USE_UART3 && defined STM32F3
    #define UARTF_TX_IO           IO_PB8
    #define UARTF_RX_IO           IO_PB9
  #elif defined UARTF_USE_UART3
    #define UARTF_TX_IO           IO_PB10
    #define UARTF_RX_IO           IO_PB11
  #else
    #define UARTF_TX_IO           IO_PC10
    #define UARTF_RX_IO           IO_PC11
  #endif
  #ifndef STM32F0
    #define UARTF_IO_AF           IO_AF_7
  #else
    #if defined UARTF_USE_UART3
      #define UARTF_IO_AF         IO_AF_4
	#elif defined UARTF_USE_UART3_REMAPPED
      #define UARTF_IO_AF         IO_AF_1
	#else  
      #error UARTF_USE_UART3 mapping not available on STM32F0 !
	#endif  
  #endif
  #define UARTF_IRQn              USART3_IRQn
  #define UARTF_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTF_IRQn
    #undef UARTF_IRQHandler
    #define UARTF_IRQn            USART3_4_IRQn
    #define UARTF_IRQHandler      USART3_4_IRQHandler
  #endif

#elif defined UARTF_USE_UART4 || defined UARTF_USE_UART4_REMAPPED
  #define UARTF_UARTx             UART4
  #ifdef UARTF_USE_UART4
    #define UARTF_TX_IO           IO_PC10
    #define UARTF_RX_IO           IO_PC11
  #else
    #define UARTF_TX_IO           IO_PA0 // only F7 !
    #define UARTF_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTF_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTF_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTF_IO_AF           IO_AF_5
  #endif
  #define UARTF_IRQn              UART4_IRQn
  #define UARTF_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTF IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTF_IRQn
    #undef UARTF_IRQHandler
    #define UARTF_IRQn            USART3_4_IRQn
    #define UARTF_IRQHandler      USART3_4_IRQHandler
  #endif

#elif defined UARTF_USE_UART5
  #define UARTF_UARTx             UART5
  #define UARTF_TX_IO             IO_PC12
  #define UARTF_RX_IO             IO_PD2
  #define UARTF_IRQn              UART5_IRQn
  #define UARTF_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTF_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTF IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTF_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTF_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

#elif defined UARTF_USE_UART6 || defined UARTF_USE_UART6_REMAPPED
  #define UARTF_UARTx             USART6
  #ifdef UARTF_USE_UART6
    #define UARTF_TX_IO           IO_PC6
    #define UARTF_RX_IO           IO_PC7
  #else
    #define UARTF_TX_IO           IO_PG14
    #define UARTF_RX_IO           IO_PG9
  #endif
  #define UARTF_IO_AF             IO_AF_8
  #define UARTF_IRQn              USART6_IRQn
  #define UARTF_IRQHandler        USART6_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTF_USE_UART7 || defined UARTF_USE_UART7_REMAPPED
  #define UARTF_UARTx             UART7
  #ifdef UARTF_USE_UART7
    #define UARTF_TX_IO           IO_PE8
    #define UARTF_RX_IO           IO_PE7
  #else
    #define UARTF_TX_IO           IO_PF7
    #define UARTF_RX_IO           IO_PF6
  #endif
  #define UARTF_IO_AF             IO_AF_8
  #define UARTF_IRQn              UART7_IRQn
  #define UARTF_IRQHandler        UART7_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTF_USE_UART8
  #define UARTF_UARTx             UART8
  #define UARTF_TX_IO             IO_PE1
  #define UARTF_RX_IO             IO_PE0
  #define UARTF_IO_AF             IO_AF_8
  #define UARTF_IRQn              UART8_IRQn
  #define UARTF_IRQHandler        UART8_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTF_USE_LPUART1 || defined UARTF_USE_LPUART1_REMAPPED
  #define UARTF_UARTx             LPUART1
  #ifdef UARTF_USE_LPUART1
    #define UARTF_TX_IO           IO_PA2
    #define UARTF_RX_IO           IO_PA3
    #ifdef STM32G4
      #define UARTF_IO_AF         IO_AF_12 // G4
    #else
      #define UARTF_IO_AF         IO_AF_8 // WL
    #endif
  #elif defined UARTF_USE_LPUART1_REMAPPED
    #define UARTF_TX_IO           IO_PC1
    #define UARTF_RX_IO           IO_PC0
    #define UARTF_IO_AF           IO_AF_8
  #endif
  #define UARTF_IRQn              LPUART1_IRQn
  #define UARTF_IRQHandler        LPUART1_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error LPUART1 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
  #endif

#else
  #error No UARTF_USE_UARTx defined!
#endif


// allows us to overwrite the default pin assignment
#ifdef UARTF_USE_TX_IO
  #undef UARTF_TX_IO
  #define UARTF_TX_IO             UARTF_USE_TX_IO
#endif
#ifdef UARTF_USE_RX_IO
  #undef UARTF_RX_IO
  #define UARTF_RX_IO             UARTF_USE_RX_IO
#endif
#ifdef UARTF_USE_IO_AF
  #undef UARTF_IO_AF
  #define UARTF_IO_AF             UARTF_USE_IO_AF
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Note: LPUART does not appear to have STOPBITS_0_5 and STOPBITS_1_5!!
//
// The LL_USART_xx() and LL_LPUART_xx() functions which only relate to flags or
// registers can be used for both USART and LPUART.
// Below we simply use the LL_USART_xx() functions for both.
// Notably, this appears to be incorrect for the init struct functions, which hence
// need special treatment.

#if defined UART_USE_LPUART1 || defined UART_USE_LPUART1_REMAPPED
#if !(LL_USART_PARITY_NONE == LL_LPUART_PARITY_NONE) || !(LL_USART_PARITY_EVEN == LL_LPUART_PARITY_EVEN) || \
    !(LL_USART_PARITY_ODD == LL_LPUART_PARITY_ODD) || \
    !(LL_USART_STOPBITS_1 == LL_LPUART_STOPBITS_1) || !(LL_USART_STOPBITS_2 == LL_LPUART_STOPBITS_2)
  //#error Missmatch of LL_USART and L_LPUART flags!
#endif
#endif


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  LL_USART_SR_RXNE
  #define FLAG_SR_ORE   LL_USART_SR_ORE
  #define FLAG_SR_NE    LL_USART_SR_NE
  #define FLAG_SR_FE    LL_USART_SR_FE
  #define FLAG_SR_TXE   LL_USART_SR_TXE
  #define FLAG_SR_TC    LL_USART_SR_TC
  #define FLAG_SR_IDLE  LL_USART_SR_IDLE
#elif defined STM32F3 || defined STM32F7 || defined STM32L4 || defined STM32F0
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#elif defined STM32G4 || defined STM32WL
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#endif

#if defined STM32F3 || defined STM32F7 || defined STM32F0
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NCF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#elif defined STM32G4 || defined STM32L4 || defined STM32WL
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UARTF_USE_RX || defined UARTF_USE_TX_ISR

