olliw42/stm32ll-lib/src/stdstm32-uartf.h
  LL_LPUART_Init(UARTF_UARTx, &UART_InitStruct);
#endif
}


void uartf_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTF_USE_LPUART1 || defined UARTF_USE_LPUART1_REMAPPED)
  LL_USART_Disable(UARTF_UARTx); // must be disabled to configure some registers
  _uartf_initprotocol(baud, parity, stopbits);
  LL_USART_Enable(UARTF_UARTx);
#else
  LL_LPUART_Disable(UARTF_UARTx); // must be disabled to configure some registers
  _uartf_initprotocol(baud, parity, stopbits);
  LL_LPUART_Enable(UARTF_UARTx);
#endif
}


void uartf_setbaudrate(uint32_t baud)
{
  uartf_setprotocol(baud, XUART_PARITY_NO, UART_STOPBIT_1);
}


void uartf_tx_enablepin(FunctionalState flag)
{
#ifdef UARTF_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UARTF_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTF_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UARTF_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}


void uartf_rx_enableisr(FunctionalState flag)
{
#ifdef UARTF_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTF_UARTx);
#endif
    LL_USART_ReceiveData8(UARTF_UARTx); // read DR to clear RXNE and error flags
    LL_USART_EnableIT_RXNE(UARTF_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UARTF_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTF_UARTx);
#endif
  }
#endif
}


void uartf_init_isroff(void)
{
  LL_USART_Disable(UARTF_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UARTF_UARTx);
#ifdef STM32F1
#if defined UARTF_USE_UART1_REMAPPED
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UARTF_USE_UART2_REMAPPED
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UARTF_USE_UART3_REMAPPED
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif // STM32F1

  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UARTF_USE_TX
  gpio_init_af(UARTF_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTF_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UARTF_USE_RX
#ifndef UARTF_INVERTED
  gpio_init_af(UARTF_RX_IO, IO_MODE_INPUT_PU, UARTF_IO_AF, IO_SPEED_VERYFAST);
#else
  gpio_init_af(UARTF_RX_IO, IO_MODE_INPUT_PD, UARTF_IO_AF, IO_SPEED_VERYFAST);
#endif
#endif

  // Configure USART/LPUART
  _uartf_initprotocol(UARTF_BAUD, XUART_PARITY_NO, UART_STOPBIT_1);
#if !(defined UARTF_USE_LPUART1 || defined UARTF_USE_LPUART1_REMAPPED)
  LL_USART_ConfigAsyncMode(UARTF_UARTx);
#if defined STM32G4
  LL_USART_DisableFIFO(UARTF_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTF_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTF_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#endif
#else
  LL_LPUART_DisableFIFO(UARTF_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UARTF_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UARTF_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

#ifdef UARTF_INVERTED
#ifdef UARTF_USE_TX
  LL_USART_SetTXPinLevel(UARTF_UARTx, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef UARTF_USE_RX
  LL_USART_SetRXPinLevel(UARTF_UARTx, LL_USART_RXPIN_LEVEL_INVERTED);
#endif
#endif

  // Configure NVIC channel
#if defined UARTF_USE_RX || defined UARTF_USE_TX_ISR
#ifdef UARTF_PREEMPTIONPRIORITY
  #error Legacy UARTF_PREEMPTIONPRIORITY used !
#endif
#ifdef UARTF_SUBPRIORITY
  #error Legacy UARTF_SUBPRIORITY used !
#endif
#ifdef UARTF_PRIORITY
#error Legacy UARTF_PRIORITY used !
#endif
#ifndef UARTF_IRQ_PRIORITY
  #define UARTF_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UARTF_IRQn, UARTF_IRQ_PRIORITY);
#endif

#ifdef UARTF_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UARTF_UARTx);
  LL_USART_DisableIT_TC(UARTF_UARTx);
  LL_USART_ClearFlag_TC(UARTF_UARTx);
  // Flush buffer
  uartf_txwritepos = uartf_txreadpos = 0;
#endif

#ifdef UARTF_USE_RX
  // Disable Receive Data register not empty interrupt
  LL_USART_DisableIT_RXNE(UARTF_UARTx);
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UARTF_UARTx);
#endif
  // Flush buffer
  uartf_rxwritepos = uartf_rxreadpos = 0;
#ifdef UARTF_USE_RXERRORCOUNT
  uartf_errorcnt_rxnoise = 0;
  uartf_errorcnt_rxframe = 0;
  uartf_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UARTF_UARTx->CR2, USART_CR2_CLKEN);
  CLEAR_BIT(UARTF_UARTx->CR3, USART_CR3_HDSEL);
#if defined USART_CR2_LINEN
  CLEAR_BIT(UARTF_UARTx->CR2, USART_CR2_LINEN);
#endif
#if defined USART_CR3_SCEN || defined USART_CR3_IREN // assume that always both are defined
  CLEAR_BIT(UARTF_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_IREN));
#endif

#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UARTF_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UARTF_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UARTF_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UARTF_USE_RXERRORCOUNT
  // Disable ORE in the first place
  LL_USART_DisableOverrunDetect(UARTF_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif

#if defined STM32G4 || defined STM32F3 || defined STM32WL || defined STM32F0
#if !defined UARTF_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UARTF_UARTx);
#endif
#endif

  // Enable USART/LPUART
  LL_USART_Enable(UARTF_UARTx);

#if defined STM32G4 ||defined STM32F3 || defined STM32WL || defined STM32F0
  // Polling UART/LPUART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UARTF_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UARTF_UARTx)))) {};
#endif
}


void uartf_init(void)
{
  uartf_init_isroff();
  uartf_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UARTF_H
